# Exercises - Database Operations

Let's create a table and perform database operations using direct SQL.

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

env: DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

### Exercise 1 - Create Table

Create table - **courses**
* course_id - sequence generated integer and primary key
* course_name - which holds alpha numeric or string values up to 60 characters
* course_author - which holds the name of the author up to 40 characters
* course_status - which holds one of these values (published, draft, inactive). 
* course_published_dt - which holds date type value. 

Provide the script as answer for this exercise.

In [3]:
%%sql

DROP TABLE
    IF EXISTS
        courses;

Done.

[]

In [4]:
%%sql

CREATE TABLE courses (
                    course_id SERIAL PRIMARY KEY,
                    course_name VARCHAR(60),
                    course_author VARCHAR(40),
                    course_status VARCHAR(10),
                    course_published_dt DATE
)

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
Done.

[]

In [5]:
%sql SELECT * FROM courses

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
0 rows affected.

[]



### Exercise 2 - Inserting Data

* Insert data into courses using the data provided. Make sure id is system generated.

|Course Name                      |Course Author         |Course Status|Course Published Date|
|---------------------------------|----------------------|-------------|---------------------|
|Programming using Python         |Bob Dillon            |published    |2020-09-30           |
|Data Engineering using Python    |Bob Dillon            |published    |2020-07-15           |
|Data Engineering using Scala     |Elvis Presley         |draft        |                     |
|Programming using Scala          |Elvis Presley         |published    |2020-05-12           |
|Programming using Java           |Mike Jack             |inactive     |2020-08-10           |
|Web Applications - Python Flask  |Bob Dillon            |inactive     |2020-07-20           |
|Web Applications - Java Spring   |Mike Jack             |draft        |                     |
|Pipeline Orchestration - Python  |Bob Dillon            |draft        |                     |
|Streaming Pipelines - Python     |Bob Dillon            |published    |2020-10-05           |
|Web Applications - Scala Play    |Elvis Presley         |inactive     |2020-09-30           |
|Web Applications - Python Django |Bob Dillon            |published    |2020-06-23           |
|Server Automation - Ansible      |Uncle Sam             |published    |2020-07-05           |

Provide the insert statement(s) as answer for this exercise.

In [6]:
%%sql

TRUNCATE TABLE 
    courses

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
Done.

[]

In [7]:
%sql SELECT * FROM courses

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
0 rows affected.

[]

In [8]:
%%sql

INSERT INTO
    courses (course_name, course_author, course_status, course_published_dt)
VALUES
    ('Programming using Python', 'Bob Dillon', 'published', '2020-09-30'),
    ('Data Engineering using Python', 'Bob Dillon', 'published', '2020-07-15'),
    ('Data Engineering using Scala', 'Elvis Presley', 'draft', NULL),
    ('Programming using Scala', 'Elvis Presley', 'published', '2020-05-12'),
    ('Programming using Java', 'Mike Jack', 'inactive', '2020-08-10'),
    ('Web Applications - Python Flask', 'Bob Dillon', 'inactive', '2020-07-20'),
    ('Web Applications - Java Spring', 'Mike Jack', 'draft', NULL),
    ('Pipeline Orchestration - Python', 'Bob Dillon', 'draft', NULL),
    ('Streaming Pipelines - Python', 'Bob Dillon', 'published', '2020-10-05'),
    ('Web Applications - Scala Play', 'Elvis Presley', 'inactive', '2020-09-30'),
    ('Web Applications - Python Django', 'Bob Dillon', 'published', '2020-06-23'),
    ('Server Automation - Ansible', 'Uncle Sam', 'published', '2020-07-05')

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
12 rows affected.

[]

In [9]:
%sql SELECT * FROM courses

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
12 rows affected.

[(1, 'Programming using Python', 'Bob Dillon', 'published', datetime.date(2020, 9, 30)),
 (2, 'Data Engineering using Python', 'Bob Dillon', 'published', datetime.date(2020, 7, 15)),
 (3, 'Data Engineering using Scala', 'Elvis Presley', 'draft', None),
 (4, 'Programming using Scala', 'Elvis Presley', 'published', datetime.date(2020, 5, 12)),
 (5, 'Programming using Java', 'Mike Jack', 'inactive', datetime.date(2020, 8, 10)),
 (6, 'Web Applications - Python Flask', 'Bob Dillon', 'inactive', datetime.date(2020, 7, 20)),
 (7, 'Web Applications - Java Spring', 'Mike Jack', 'draft', None),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'draft', None),
 (9, 'Streaming Pipelines - Python', 'Bob Dillon', 'published', datetime.date(2020, 10, 5)),
 (10, 'Web Applications - Scala Play', 'Elvis Presley', 'inactive', datetime.date(2020, 9, 30)),
 (11, 'Web Applications - Python Django', 'Bob Dillon', 'published', datetime.date(2020, 6, 23)),
 (12, 'Server Automation - Ansible', 'Uncle Sam', 'published', datetime.date(2020, 7, 5))]

### Exercise 3 - Updating Data

Update the status of all the **draft courses** related to Python and Scala to **published** along with the **course_published_dt using system date**. 

Provide the update statement as answer for this exercise.

In [10]:
%%sql

UPDATE
    courses
SET
    course_status = 'published',
    course_published_dt = CURRENT_DATE
WHERE
    course_status = 'draft'
    AND
    (LOWER(course_name) LIKE '%python%'
    OR
    LOWER(course_name) LIKE '%scala%')

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
2 rows affected.

[]

In [11]:
%sql SELECT * FROM courses

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
12 rows affected.

[(1, 'Programming using Python', 'Bob Dillon', 'published', datetime.date(2020, 9, 30)),
 (2, 'Data Engineering using Python', 'Bob Dillon', 'published', datetime.date(2020, 7, 15)),
 (4, 'Programming using Scala', 'Elvis Presley', 'published', datetime.date(2020, 5, 12)),
 (5, 'Programming using Java', 'Mike Jack', 'inactive', datetime.date(2020, 8, 10)),
 (6, 'Web Applications - Python Flask', 'Bob Dillon', 'inactive', datetime.date(2020, 7, 20)),
 (7, 'Web Applications - Java Spring', 'Mike Jack', 'draft', None),
 (9, 'Streaming Pipelines - Python', 'Bob Dillon', 'published', datetime.date(2020, 10, 5)),
 (10, 'Web Applications - Scala Play', 'Elvis Presley', 'inactive', datetime.date(2020, 9, 30)),
 (11, 'Web Applications - Python Django', 'Bob Dillon', 'published', datetime.date(2020, 6, 23)),
 (12, 'Server Automation - Ansible', 'Uncle Sam', 'published', datetime.date(2020, 7, 5)),
 (3, 'Data Engineering using Scala', 'Elvis Presley', 'published', datetime.date(2023, 1, 4)),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'published', datetime.date(2023, 1, 4))]

### Exercise 4 - Deleting Data

Delete all the courses which are neither in draft mode nor published.

Provide the delete statement as answer for this exercise.

In [12]:
%%sql

DELETE FROM 
    courses
WHERE
    course_status NOT IN ('draft', 'published')

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
3 rows affected.

[]

In [13]:
%sql SELECT * FROM courses

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
9 rows affected.

[(1, 'Programming using Python', 'Bob Dillon', 'published', datetime.date(2020, 9, 30)),
 (2, 'Data Engineering using Python', 'Bob Dillon', 'published', datetime.date(2020, 7, 15)),
 (4, 'Programming using Scala', 'Elvis Presley', 'published', datetime.date(2020, 5, 12)),
 (7, 'Web Applications - Java Spring', 'Mike Jack', 'draft', None),
 (9, 'Streaming Pipelines - Python', 'Bob Dillon', 'published', datetime.date(2020, 10, 5)),
 (11, 'Web Applications - Python Django', 'Bob Dillon', 'published', datetime.date(2020, 6, 23)),
 (12, 'Server Automation - Ansible', 'Uncle Sam', 'published', datetime.date(2020, 7, 5)),
 (3, 'Data Engineering using Scala', 'Elvis Presley', 'published', datetime.date(2023, 1, 4)),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'published', datetime.date(2023, 1, 4))]

### Validation 

Get count of all published courses by author and make sure output is sorted in descending order by count. 

```sql
SELECT course_author, count(1) AS course_count
FROM courses
WHERE course_status= 'published'
GROUP BY course_author
```

|Course Author   |Course Count|
|----------------|------------|
|Bob Dillon      |5           |
|Elvis Presley   |2           |
|Uncle Sam       |1           |

In [14]:
%%sql

SELECT 
    course_author,
    COUNT(course_name) AS course_count
FROM
    courses
WHERE
    course_status = 'published'
GROUP BY
    course_author
ORDER BY
    course_count DESC

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
3 rows affected.

[('Bob Dillon', 5), ('Elvis Presley', 2), ('Uncle Sam', 1)]